{
  "backend/main.mo": "Main canister implementing user profiles with optional avatars, reviews with optional cover images, comments, and reading‑tracker logic under access control.",
  "backend/migration.mo": "Migration module converting old review and user‑profile data to new versions that include nullable cover and avatar fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across components, hooks, pages, and utilities.",
  "frontend/DEPLOYMENT_SMOKE_CHECK.md": "Deployment checklist for verifying build integrity, routing, authentication, and core app functionality.",
  "frontend/index.css": "Global Tailwind CSS theme defining light/dark tokens, color variables, and base styling.",
  "frontend/index.html": "Basic HTML entry point mounting the app root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Application router setup using TanStack Router with layout wrapper, profile modal, and development route validation.",
  "frontend/src/components/CopyAppLinkControl.tsx": "UI control enabling users to copy the app URL with clipboard support and fallback dialog.",
  "frontend/src/components/Layout.tsx": "Main app layout with navigation, user info, mobile menu, and header wrapping all pages.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling login/logout, error states, and identity status display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to set name and optional avatar, including validation and upload handling.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Fetches the authenticated user's profile from the backend via react-query.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Saves user profile changes and invalidates the related query on success.",
  "frontend/src/hooks/reviews/useComments.ts": "Loads comments for a specific review using the actor API.",
  "frontend/src/hooks/reviews/useLatestReviews.ts": "Fetches the latest reviews up to a specified limit.",
  "frontend/src/hooks/reviews/useReview.ts": "Retrieves a single review by ID from the backend.",
  "frontend/src/hooks/reviews/useReviewMutations.ts": "Provides mutations for adding reviews, liking/unliking, and adding comments with cache invalidation.",
  "frontend/src/hooks/tracker/useReadingMetrics.ts": "Fetches authenticated user's reading metrics from the backend.",
  "frontend/src/hooks/tracker/useTrackedBooks.ts": "Loads the authenticated user's tracked books list.",
  "frontend/src/hooks/tracker/useTrackerMutations.ts": "Mutations for adding, updating, and removing tracked books and updating reading metrics.",
  "frontend/src/hooks/useActor.ts": "Builds and caches the backend actor based on identity and manages refetching dependent queries.",
  "frontend/src/hooks/useExternalBlobImageUrl.ts": "Converts an ExternalBlob into a usable image URL with direct or fallback loading.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, loading stored identities, managing login state, and exposing login/clear functions.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes and global typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ReaderDashboardPage.tsx": "Displays user reading metrics and tracked books, showing stats or a login prompt depending on authentication.",
  "frontend/src/pages/ReadingTrackerPage.tsx": "Allows authenticated users to manage tracked books, update reading progress, and record pages and hours read.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Shows a detailed view of a single review with likes, comments, and cover image handling, falling back if not found.",
  "frontend/src/pages/ReviewsFeedPage.tsx": "Renders a reviews feed and a form for adding new reviews with optional cover images, validating and previewing uploads.",
  "frontend/src/utils/appLink.ts": "Provides browser-safe helpers to get the app's origin and full URL or return null outside browser contexts.",
  "frontend/src/utils/buildInfo.ts": "Provides functions to read build metadata from environment variables with fallbacks and generate a short build identifier.",
  "frontend/src/utils/format.ts": "Formats bigint timestamps into relative time strings or formatted dates based on age.",
  "frontend/src/utils/internetIdentityConfig.ts": "Computes Internet Identity auth configuration based on environment variables and runtime origin with local and production fallbacks.",
  "frontend/src/utils/referral.ts": "Generates a UTM content value from the current hostname or falls back to a default.",
  "frontend/src/utils/uploadValidation.ts": "Validates uploaded image files for type and size and provides helpers to create and revoke preview URLs.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters (including hash-based), persisting them in sessionStorage, and clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing features, issues, and versions for a book review and reading tracker application."
}