{
  "backend/main.mo": "Motoko backend implementing access‑controlled user profiles, reviews, comments, reading tracker data, and reading metrics storage with create/read operations.",
  "feature_evidence.json": "Feature evidence report linking feature IDs to affected frontend files, components, and tests for deployment verification.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose, styling, and component behavior.",
  "frontend/DEPLOYMENT_SMOKE_CHECK.md": "Deployment checklist outlining pre‑publish checks, post‑publication verification steps, navigation tests, authentication flow, and core feature smoke tests.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH color tokens, dark mode variables, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point containing root mount node and script loading React application.",
  "frontend/src/App.tsx": "Main React router setup defining all core routes and including layout and profile modal, plus dev‑mode route verification.",
  "frontend/src/components/CopyAppLinkControl.tsx": "UI control that copies the app’s URL using the Clipboard API with fallback dialog when copy fails.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header, navigation (desktop and mobile), footer, and renders children content.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout handling with Internet Identity, including error handling and status display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to enter and save their name.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Fetches the authenticated user's profile using the actor and exposes loading and fetched state.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Saves the user's profile via mutation and invalidates the profile query on success.",
  "frontend/src/hooks/reviews/useComments.ts": "Fetches comments for a given review using the actor.",
  "frontend/src/hooks/reviews/useLatestReviews.ts": "Retrieves the latest reviews up to a specified limit.",
  "frontend/src/hooks/reviews/useReview.ts": "Fetches a single review by ID.",
  "frontend/src/hooks/reviews/useReviewMutations.ts": "Provides mutations for adding reviews, liking/unliking, and adding comments with related query invalidation.",
  "frontend/src/hooks/tracker/useReadingMetrics.ts": "Fetches authenticated user's reading metrics from the actor.",
  "frontend/src/hooks/tracker/useTrackedBooks.ts": "Gets the user's tracked books list when authenticated.",
  "frontend/src/hooks/tracker/useTrackerMutations.ts": "Provides mutations for managing tracked books and reading progress with cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an actor instance based on identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, stored identity loading, and auth-client creation.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, along with global body and border styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/ReaderDashboardPage.tsx": "Displays a user's reading statistics and tracked books, showing metrics and progress when authenticated.",
  "frontend/src/pages/ReadingTrackerPage.tsx": "Allows authenticated users to manage tracked books, update progress and metrics, and add or remove entries.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Shows a detailed view of a single review with likes, comments, and metadata, supporting interactions when authenticated.",
  "frontend/src/pages/ReviewsFeedPage.tsx": "Displays a feed of recent reviews and provides an authenticated form for creating new reviews.",
  "frontend/src/utils/appLink.ts": "Provides helpers to safely access the app's current origin or full URL in browser contexts.",
  "frontend/src/utils/buildInfo.ts": "Provides build metadata utilities that read version and timestamp from environment variables with fallbacks and generate a short build identifier.",
  "frontend/src/utils/format.ts": "Formats bigint timestamps into relative time strings or a short date when older than a week.",
  "frontend/src/utils/internetIdentityConfig.ts": "Computes Internet Identity provider and derivation origin based on environment, with fallbacks for local and production deployments.",
  "frontend/src/utils/referral.ts": "Generates a UTM content value from the current hostname or a fallback string when unavailable.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and manipulating hash‑based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and theme utilities for the frontend.",
  "project_state.json": "Tracks project state, features, issues, and metadata for the book review platform."
}