{
  "backend/main.mo": "Main Motoko canister implementing access control, user profiles, reviews, comments, and reading‑tracker data with CRUD and query methods.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten map of frontend file paths to short human‑readable summaries.",
  "frontend/DEPLOYMENT_SMOKE_CHECK.md": "Short deployment checklist for verifying app behavior before publishing.",
  "frontend/index.css": "Tailwind base file defining design‑token CSS variables for light and dark themes.",
  "frontend/index.html": "Base HTML file loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining core routes and layout with development route checks.",
  "frontend/src/components/CopyAppLinkControl.tsx": "UI control allowing users to copy the app link with clipboard fallback dialog.",
  "frontend/src/components/Layout.tsx": "Global layout with header navigation, mobile menu, login button, and footer.",
  "frontend/src/components/LoginButton.tsx": "UI button component handling Internet Identity login/logout with error display and retry logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their display name.",
  "frontend/src/hooks/auth/useCallerUserProfile.ts": "Fetches the current user's profile using the backend actor, tracking loading and fetch state.",
  "frontend/src/hooks/auth/useSaveCallerUserProfile.ts": "Mutation hook to save the caller's user profile and invalidate related queries.",
  "frontend/src/hooks/reviews/useComments.ts": "Loads comments for a given review ID via the backend actor.",
  "frontend/src/hooks/reviews/useLatestReviews.ts": "Fetches a list of the latest reviews with an optional limit.",
  "frontend/src/hooks/reviews/useReview.ts": "Fetches a single review by ID from the backend actor.",
  "frontend/src/hooks/reviews/useReviewMutations.ts": "Provides mutations for adding reviews, liking/unliking reviews, and adding comments with cache invalidation.",
  "frontend/src/hooks/tracker/useReadingMetrics.ts": "Fetches authenticated user's reading metrics from the backend actor.",
  "frontend/src/hooks/tracker/useTrackedBooks.ts": "Fetches the authenticated user's tracked books list.",
  "frontend/src/hooks/tracker/useTrackerMutations.ts": "Mutations for adding, updating, removing tracked books and updating reading metrics with cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor bound to the current identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider managing Internet Identity login, stored identity, and login status.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styling for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/ReaderDashboardPage.tsx": "Displays authenticated users’ reading stats and currently tracked books using metrics and tracked-books hooks.",
  "frontend/src/pages/ReadingTrackerPage.tsx": "Provides an interface for authenticated users to add books, update progress and metrics, and manage their reading list.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Shows a single review with rating, likes, comments, and allows authenticated users to interact via likes and comments.",
  "frontend/src/pages/ReviewsFeedPage.tsx": "Displays a feed of recent reviews and lets authenticated users submit new reviews through a form.",
  "frontend/src/utils/appLink.ts": "Utility functions that safely return the app’s origin or full URL when running in a browser.",
  "frontend/src/utils/format.ts": "Formats bigint timestamps into relative or short date strings for UI display.",
  "frontend/src/utils/internetIdentityConfig.ts": "Builds Internet Identity config at runtime, selecting provider and derivation origin based on environment and hostname.",
  "frontend/src/utils/referral.ts": "Generates a UTM content value based on the current hostname with a safe fallback for non-browser contexts.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including support for hash routing and persistence.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS setup with custom colors, container settings, animations, and theme extensions including plugins.",
  "project_state.json": "Stores project metadata, existing features, issues, and versioned state for a book review and reading tracker app."
}