{
  "kind": "build_request",
  "title": "Add book cover attachments to reviews and user profile picture uploads",
  "projectName": "Book Readers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Extend the backend data model and canister methods to support an optional uploaded book-cover attachment on each review, including storing the image data and returning it when fetching/listing reviews.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just checking can we add attachment option to upload book cover while writing reviews and profile picture option for every users"
        ]
      },
      "acceptanceCriteria": [
        "Backend `Review` type includes an optional cover image field (e.g., bytes + content type) without breaking existing review fields (title, author, isbn, rating, reviewText, createdAt, likes, likedBy).",
        "`addReview(...)` supports supplying an optional cover image when creating a review (and continues to work when no image is supplied).",
        "`getLatestReviews(limit)` and `getReview(id)` return the cover image field so the frontend can render it.",
        "Server-side validation rejects unsupported content types and rejects images above a defined size limit to prevent oversized canister state growth."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Update the Review creation UI on the Reviews Feed page to allow authenticated users to attach an optional book cover image while writing a review, including basic client-side validation and preview before publishing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just checking can we add attachment option to upload book cover while writing reviews and profile picture option for every users"
        ]
      },
      "acceptanceCriteria": [
        "The 'Write a Review' form (frontend/src/pages/ReviewsFeedPage.tsx) includes a file input for an optional book cover image.",
        "The UI enforces basic client-side validation (supported image types and a size limit) and shows a preview thumbnail when an image is selected.",
        "Submitting a review successfully publishes whether or not an image is attached, and clears the attachment state after success.",
        "TypeScript build passes with no type errors related to the new attachment field(s)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Render the uploaded book cover image (when present) in the review cards on the Reviews Feed page and on the Review Detail page, with sensible fallback styling when no cover is attached.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just checking can we add attachment option to upload book cover while writing reviews and profile picture option for every users"
        ]
      },
      "acceptanceCriteria": [
        "Reviews Feed shows a cover thumbnail when a review includes a cover image; reviews without covers continue to render cleanly without broken image UI.",
        "Review Detail page shows the cover image when present.",
        "Images are rendered using the returned content type and bytes from the canister response (no external image hosting dependency)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Extend the backend user profile model to support an optional user profile picture (avatar) upload per user, and allow saving/updating it via the existing authenticated profile save flow.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just checking can we add attachment option to upload book cover while writing reviews and profile picture option for every users"
        ]
      },
      "acceptanceCriteria": [
        "Backend `UserProfile` type includes an optional avatar image field (e.g., bytes + content type) in addition to `name`.",
        "`saveCallerUserProfile(profile)` can store/update the avatar for the authenticated caller and continues to work when avatar is omitted.",
        "`getCallerUserProfile()` and `getUserProfile(user)` include the avatar field in responses (respecting existing access control).",
        "Server-side validation rejects unsupported content types and rejects images above a defined size limit."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Update the profile setup/edit UI to allow each authenticated user to upload (and update) a profile picture, including preview and client-side validation, while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Just checking can we add attachment option to upload book cover while writing reviews and profile picture option for every users"
        ]
      },
      "acceptanceCriteria": [
        "The profile setup modal (frontend/src/components/ProfileSetupModal.tsx) includes an optional avatar upload control with preview.",
        "Saving the profile stores the name and (if provided) avatar to the backend; users can proceed without uploading an avatar.",
        "After save, the avatar is visible somewhere in the signed-in UI (e.g., header area) and does not break existing navigation or login/logout UX.",
        "TypeScript build passes with no type errors related to the new profile avatar field(s)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; keep all Motoko logic in backend/main.mo (add migration.mo only if truly required by stable state changes).",
    "Do not edit any files under frontend/src/components/ui or any paths listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Use English for any new or changed user-facing text.",
    "Do not introduce external storage/services for images; store and serve image bytes via the canister.",
    "Implement strict size/type validation for uploads to limit canister state growth."
  ],
  "nonGoals": [
    "Adding third-party image hosting/CDN integrations.",
    "Adding social login or any authentication provider other than Internet Identity.",
    "Building real-time features (e.g., live updates via websockets).",
    "Complex image editing/cropping tooling (basic upload + preview + validation only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}