{
  "kind": "build_request",
  "title": "Fully publish current draft and run post-publish smoke check",
  "projectName": "Book Readers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Fully publish the currently deployed draft (Draft Version 12) so the latest frontend and backend changes are live (not just a draft deployment).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes publish"
        ]
      },
      "acceptanceCriteria": [
        "The application is successfully fully published (go-live) from the current draft (Draft Version 12) without deployment errors.",
        "The published app URL serves the latest version (not the prior published build)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "After publication succeeds, manually verify the published build using the existing checklist in `frontend/DEPLOYMENT_SMOKE_CHECK.md`, ensuring that all core routes load and that the Reader Dashboard is reachable at `/dashboard` and via the primary navigation on both desktop and mobile screen sizes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Yes publish"
        ]
      },
      "acceptanceCriteria": [
        "On the published deployment, the routes `/`, `/tracker`, and `/dashboard` load successfully.",
        "The Dashboard page is reachable via the header primary navigation on desktop and via the mobile navigation menu on small screens.",
        "A direct visit to `/dashboard` renders the Reader Dashboard page (not a 404, blank page, or redirect loop)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose them only).",
    "Do not edit any paths listed as immutable in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`)."
  ],
  "nonGoals": [
    "Do not introduce new product features beyond publishing and verification.",
    "Do not redesign UI/UX as part of this publish request.",
    "Do not change backend data models or add new canister methods unless required to unblock publishing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}