{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Publish readiness + post-publish smoke check wiring (Book Readers)",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Add a visible published-build identifier in the UI to confirm the latest draft is what’s live after go-live publication.",
      "acceptanceCriteria": [
        "The application is successfully fully published (go-live) from the current draft (Draft Version 12) without deployment errors.",
        "The published app URL serves the latest version (not the prior published build)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/buildInfo.ts",
          "operation": "create",
          "description": "Create a small utility to read a build identifier (e.g., from Vite env such as a version/commit/build timestamp) with safe fallbacks for environments where it’s not set."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Wire the build identifier into the existing footer (or other non-intrusive area) so QA can confirm the published URL is serving the latest build after go-live publication."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Update the existing deployment smoke checklist to explicitly verify core routes and Dashboard reachability via desktop and mobile primary navigation after publication.",
      "acceptanceCriteria": [
        "On the published deployment, the routes `/`, `/tracker`, and `/dashboard` load successfully.",
        "The Dashboard page is reachable via the header primary navigation on desktop and via the mobile navigation menu on small screens.",
        "A direct visit to `/dashboard` renders the Reader Dashboard page (not a 404, blank page, or redirect loop)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_SMOKE_CHECK.md",
          "operation": "modify",
          "description": "Expand the checklist steps to include: (1) load `/`, `/tracker`, `/dashboard` directly on the published URL, (2) verify Dashboard is reachable via desktop header primary navigation, (3) verify Dashboard is reachable via mobile navigation menu at small screen sizes, and (4) verify the UI build identifier matches the intended published draft/build."
        }
      ]
    }
  ]
}